practicals/ps7/karman/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0 0)
    (8  0 0)
    (8  1 0)
    (0  1 0)
    (0  0 0.025)
    (8  0 0.025)
    (8  1 0.025)
    (0  1 0.025)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (320 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	inlet
	{
	    type patch;
	    faces
	    (
	        (0 4 7 3)
	    );
	}
	
	outlet
	{
	    type patch;
	    faces
	    (
	        (1 2 6 5)
	    );
	}

    topAndBottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (7 6 2 3)
        );
    }	

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
